zaremy/r2-z2/firmware/touch_check/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# No PSRAM: this app allocates nothing that needs it. (CONFIG_SPIRAM=y was also
# suspected of causing the serial silence during bring-up. It was tested and
# CLEARED -- turning it off changed nothing. It is off here because it is
# genuinely unneeded, not as a workaround.)

# REQUIRED for any output to reach the host. The IDF default is
# CONFIG_ESP_CONSOLE_UART_DEFAULT, which puts stdout on UART0's physical pins
# (GPIO43/44). This board's only port is the ESP32-S3's native USB-Serial/JTAG,
# so a UART0 console writes into pads nothing is attached to and the app looks
# dead. Necessary but NOT sufficient -- see firmware/touch_check/main/main.c for
# the attach procedure, which is the other half.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
